Use Mermaid not ASCII art
Signed-off-by: Rick Taylor <rtaylor@aalyria.com>
